#Схуднення сніданок
fwbt=[
"Варіант 1 \n\n\
1. Крупа (вівсяна, гречана, перлова, пшоняна, кукурудзяна на вибір) 80 грам\n\
2. Яйця, 3 шт. (варені)\n\
3. 40 грам сиру з хлібцем",

"Варіант 2\n\n\
Бутерброд із цільнозернового хліба 100 грам із сиром 30 грам та 3 яйцями",

"Варіант 3\n\n\
Салат (відварена грудка/індичка/яловичина 150 гр. та овочі 100 гр.) + цільнозерновий хліб 140 гр.",

]
#Схуднення обід
fwlh=[
"1. Гречка / Рис бурий або дикий / Макарони твердих сортів пшениці / Картопля печена (бобові на вибір) 80 грам\n\
2. Будь-яка риба / Птах / М'ясо (крім свинини та баранини) 250 грам\n\
3. Овочі (будь-які крім коренеплодів) 200 грам"

]
#Схуднення вечеря
fwdr=[
"1. Гречка / Макарони твердих сортів / Бурий чи дикий рис 80 грам\n\
2. Овочі 200 грам\n\
3. Риба / М'ясо / Птах 200 грам"

]
#Набір маси сніданок
fmbt=[
"1. кукурудзяна каша на молоці (100 г сухої крупи);\n\
2. вершкове масло (1 чайна ложка);\n\
3. яєчня-глазунья з 1 яйця та 2-х білків;\n\
4. молоко (200 мл);\n\
5. тост із зернового хліба."

]
#Набір маси обід
fmlh=[
"1. каша перлова на воді (100 г сухої крупи)\n\
2. гуляш із яловичини (200 грамів);\n\
3. овочевий салат (150 г);\n\
4. скибочка житнього хліба."
    
]
#Набір маси вечеря 
fmdr=[
"1. куряча грудка (200 г);\n\
2. рис (100 г);\n\
3. консервовані овочі (150 г)."    

]
#Тренування набір маси
muscle=[
"Варіант 1:\n\n\
Присідання із штангою на спині: 5 підходів по 5 разів.",
"Варіант 2:\n\n\
Жим лежачи: 5 підходів по 5 разів.",
"Варіант 3:\n\n\
Станова тяга: 1 підхід по 5 разів.",
"Варіант 4:\n\n\
Жим штанги стоячи: 5 підходів по 5 разів.",
"Варіант 5: \n\n\
Тяга штанги у нахилі: 5 підходів по 5 разів."

]
#Тренування схуднення
waste=[
"Варіант 1:\n\n\
15 хвилин чергування бігу підтюпцем (близько 8 км/год) та кроку: 30 секунд бігу, ходьба до відновлення.\
Ідіть, доки не відчуєте в собі сили бігти наступні 30 секунд. Якщо ви можете бігти довше 30 секунд, робіть це.",
"Варіант 2:\n\n\
Скручування на прес - 3 підходи по 15 повторень.",
"Варіант 3:\n\n\
Підйоми рук та ніг - 3 підходи по 16 повторень.",
"Варіант 4:\n\n\
Присідання – 3 підходи по 15 повторень.",
"Варіант 5: \n\n\
Віджимання від опори - 3 підходи по 20 повторень."

]
#Тренування схеми
schema=[
"<b>Тренувальні схеми</b>\n\n\
За допомогою базових вправ ми можемо побудувати два тренування з різною послідовністю.\n\n\
Тренування А:\n\
- Присідання\n\
- жим лежачи\n\
- Потяг штанги в нахилі.\n\n\
Тренування В:\n\
- Присідання\n\
- Жим штанги стоячи\n\
- станова тяга.\n\n\
Для успішного результату достатньо займатися тричі на тиждень, чергуючи між собою перше і друге тренування.\
Між двома тренуваннями необхідно відпочивати бодай один день, давати організму відновитись."

]
#Тренування розклад
schedule=[
"<b>Розклад на тиждень</b>\n\n\
Ця система також має розклад, який допоможе вам краще орієнтуватися і зрозуміти, коли займатися, а коли відпочивати.\n\n\
Понеділок – тренування А.\n\
Вівторок – перерва.\n\
Середовище – тренування В.\n\
Четвер – перерва.\n\
П'ятниця – тренування А.\n\
Субота та неділя – перерва."

]
allList = {
    "fwbt":fwbt,
    "fwlh":fwlh,
    "fwdr":fwdr,
    "fmbt":fmbt,
    "fmlh":fmlh,
    "fmdr":fmdr,
    "muscle":muscle,
    "waste":waste,
    "schema":schema,
    "schedule":schedule
}
def getText(name,idx):
    return allList[name][idx]
def getCount(name):
    return len(allList[name])
